       IDENTIFICATION DIVISION.
       PROGRAM-ID. S.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT BSIT2-1 ASSIGN TO "BSIT2-1.DAT".
           SELECT BSIT2-2 ASSIGN TO "BSIT2-2.DAT".
           SELECT STUD-MGR ASSIGN TO "STUD-MGR.DAT".
           SELECT STUD-WRK ASSIGN TO "STUD-WRK.DAT".
           SELECT STUD-PRT ASSIGN TO "STUD-PRT.DAT".
       DATA DIVISION.
       FILE SECTION.
       FD  BSIT2-1
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS BSIT2-1-REC.
       01  BSIT2-1-REC.
           02 BSIT2-1-NUMBER PIC X(10).
           02 BSIT2-1-NAME PIC X(25).
           02 BSIT2-1-QUIZ1 PIC 9V99.
           02 BSIT2-1-QUIZ2 PIC 9V99.
           02 BSIT2-1-QUIZ3 PIC 9V99.
       FD  BSIT2-2
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS BSIT2-2-REC.
       01  BSIT2-2-REC.
           02 BSIT2-2-NUMBER PIC X(10).
           02 BSIT2-2-NAME PIC X(25).
           02 BSIT2-2-QUIZ1 PIC 9V99.
           02 BSIT2-2-QUIZ2 PIC 9V99.
           02 BSIT2-2-QUIZ3 PIC 9V99.

       FD  STUD-MGR
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS STUD-MGR-REC.
       01  STUD-MGR-REC.
           02 STUD-MGR-NUMBER PIC X(10).
           02 STUD-MGR-NAME PIC X(25).
           02 STUD-MGR-QUIZ1 PIC 9V99.
           02 STUD-MGR-QUIZ2 PIC 9V99.
           02 STUD-MGR-QUIZ3 PIC 9V99.

       FD  STUD-PRT
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS STUD-PRT-REC.
       01  STUD-PRT-REC PIC X(80).

       SD  STUD-WRK
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS STUD-WRK-REC.
       01  STUD-WRK-REC.
           02 STUD-WRK-NUMBER PIC X(10).
           02 STUD-WRK-NAME PIC X(25).
           02 STUD-WRK-QUIZ1 PIC 9V99.
           02 STUD-WRK-QUIZ2 PIC 9V99.
           02 STUD-WRK-QUIZ3 PIC 9V99.

       WORKING-STORAGE SECTION.
       01  EOF PIC X(3) VALUE "NO".
       01  HDG-1.
           02 FILLER PIC X(20) VALUE SPACES.
           02 FILLER PIC X(22) VALUE "POLYTECHNIC UNIVERSITY".
           02 FILLER PIC X(19) VALUE " OF THE PHILIPPINES".
       01  HDG-2.
           02 FILLER PIC X(31) VALUE SPACES.
           02 FILLER PIC X(18) VALUE "QUEZON CITY CAMPUS".
       01  HDG-3.
           02 FILLER PIC X(30) VALUE SPACES.
           02 FILLER PIC X(19) VALUE "BSIT 2-1 & BSIT 2-2".
       01  HDG-4.
           02 FILLER PIC X(34) VALUE SPACES.
           02 FILLER PIC X(12) VALUE "QUIZ SUMMARY".
       01  HDG-5.
           02 FILLER PIC X(5) VALUE SPACES.
           02 FILLER PIC X(14) VALUE "STUDENT NUMBER".
           02 FILLER PIC X(6) VALUE SPACES.
           02 FILLER PIC X(12) VALUE "STUDENT NAME".
           02 FILLER PIC X(9) VALUE SPACES.
           02 FILLER PIC X(6) VALUE "QUIZ#1".
           02 FILLER PIC X(3) VALUE SPACES.
           02 FILLER PIC X(6) VALUE "QUIZ#2".
           02 FILLER PIC X(3) VALUE SPACES.
           02 FILLER PIC X(6) VALUE "QUIZ#3".
           02 FILLER PIC X(3) VALUE SPACES.
           02 FILLER PIC X(7) VALUE "AVERAGE".
       01  PRINT-LINE.
           02 FILLER PIC X(6) VALUE SPACES.
           02 MRG-NUMBER-OUT PIC X(10).
           02 FILLER PIC X(4) VALUE SPACES.
           02 MRG-NAME-OUT PIC X(25).
           02 FILLER PIC X(2) VALUE SPACES.
           02 MRG-QUIZ1-OUT PIC 9.99.
           02 FILLER PIC X(5) VALUE SPACES.
           02 MRG-QUIZ2-OUT PIC 9.99.
           02 FILLER PIC X(5) VALUE SPACES.
           02 MRG-QUIZ3-OUT PIC 9.99.
           02 FILLER PIC X(6) VALUE SPACES.
           02 MRG-AVERAGE-OUT PIC 9.99.
       01  HDG-6.
           02 FILLER PIC X(5) VALUE SPACES.
           02 FILLER PIC X(16) VALUE "PER QUIZ AVERAGE".
           02 FILLER PIC X(26) VALUE SPACES.
           02 AVG-QUIZ1-OUT PIC 9.99.
           02 FILLER PIC X(5) VALUE SPACES.
           02 AVG-QUIZ2-OUT PIC 9.99.
           02 FILLER PIC X(5) VALUE SPACES.
           02 AVG-QUIZ3-OUT PIC 9.99.
           02 FILLER PIC X(6) VALUE SPACES.
           02 AVG-AVERAGE-GRADE-OUT PIC 9.99.
       01  HDG-7.
           02 FILLER PIC X(5) VALUE SPACES.
           02 FILLER PIC X(22) VALUE "HIGHEST GRADE PER QUIZ".
           02 FILLER PIC X(20) VALUE SPACES.
           02 HIGHEST-QUIZ1-OUT PIC 9.99.
           02 FILLER PIC X(5) VALUE SPACES.
           02 HIGHEST-QUIZ2-OUT PIC 9.99.
           02 FILLER PIC X(5) VALUE SPACES.
           02 HIGHEST-QUIZ3-OUT PIC 9.99.
       01  HDG-8.
           02 FILLER PIC X(5) VALUE SPACES.
           02 FILLER PIC X(21) VALUE "LOWEST GRADE PER QUIZ".
           02 FILLER PIC X(21) VALUE SPACES.
           02 LOWEST-QUIZ1-OUT PIC 9.99.
           02 FILLER PIC X(5) VALUE SPACES.
           02 LOWEST-QUIZ2-OUT PIC 9.99.
           02 FILLER PIC X(5) VALUE SPACES.
           02 LOWEST-QUIZ3-OUT PIC 9.99.
       01  HDG-9.
           02 FILLER PIC X(5) VALUE SPACES.
           02 FILLER PIC X(21) VALUE "HIGHEST GRADE AVERAGE".
           02 FILLER PIC X(49) VALUE SPACES.
           02 HIGHEST-AVERAGE-OUT PIC 9.99.
       01  HDG-10.
           02 FILLER PIC X(5) VALUE SPACES.
           02 FILLER PIC X(20) VALUE "LOWEST GRADE AVERAGE".
           02 FILLER PIC X(50) VALUE SPACES.
           02 LOWEST-AVERAGE-OUT PIC 9.99.
       01  AVG-GRADE PIC 9V99.
       01  TOTAL-STUD PIC 99 VALUE ZEROES.
       01  SUM-QUIZ1 PIC 9999V99 VALUE ZEROES.
       01  SUM-QUIZ2 PIC 9999V99 VALUE ZEROES.
       01  SUM-QUIZ3 PIC 9999V99 VALUE ZEROES.
       01  SUM-AVERAGE PIC 9999V99 VALUE ZEROES.
       01  AVG-QUIZ1 PIC 9V99 VALUE ZEROES.
       01  AVG-QUIZ2 PIC 9V99 VALUE ZEROES.
       01  AVG-QUIZ3 PIC 9V99 VALUE ZEROES.
       01  AVG-AVERAGE-GRADE PIC 9V99 VALUE ZEROES.
       01  HIGHEST-QUIZ1 PIC 9V99 VALUE ZEROES.
       01  HIGHEST-QUIZ2 PIC 9V99 VALUE ZEROES.
       01  HIGHEST-QUIZ3 PIC 9V99 VALUE ZEROES.
       01  LOWEST-QUIZ1 PIC 9V99 VALUE ZEROES.
       01  LOWEST-QUIZ2 PIC 9V99 VALUE ZEROES.
       01  LOWEST-QUIZ3 PIC 9V99 VALUE ZEROES.
       01  HIGHEST-AVERAGE PIC 9V99 VALUE ZEROES.
       01  LOWEST-AVERAGE PIC 9V99 VALUE ZEROES.
       PROCEDURE DIVISION.
       MAIN.
           MERGE STUD-WRK
            ON ASCENDING KEY STUD-WRK-NAME
            ON DESCENDING KEY STUD-WRK-NUMBER
              USING BSIT2-1, BSIT2-2
              GIVING STUD-MGR.
           OPEN INPUT STUD-MGR
                OUTPUT STUD-PRT.
           READ STUD-MGR AT END MOVE "YES" TO EOF.

           WRITE STUD-PRT-REC FROM HDG-1 AFTER 2 LINES.
           WRITE STUD-PRT-REC FROM HDG-2 AFTER 1 LINES.
           WRITE STUD-PRT-REC FROM HDG-3 AFTER 1 LINES.
           WRITE STUD-PRT-REC FROM HDG-4 AFTER 2 LINES.
           WRITE STUD-PRT-REC FROM HDG-5 AFTER 2 LINES
           MOVE SPACES TO STUD-PRT-REC.

           PERFORM READ-RTN UNTIL EOF = "YES".
           IF EOF = "YES"
              COMPUTE AVG-QUIZ1 = SUM-QUIZ1 / TOTAL-STUD
              COMPUTE AVG-QUIZ2 = SUM-QUIZ2 / TOTAL-STUD
              COMPUTE AVG-QUIZ3 = SUM-QUIZ3 / TOTAL-STUD
              COMPUTE AVG-AVERAGE-GRADE = SUM-AVERAGE / TOTAL-STUD
              MOVE AVG-QUIZ1 TO AVG-QUIZ1-OUT
              MOVE AVG-QUIZ2 TO AVG-QUIZ2-OUT
              MOVE AVG-QUIZ3 TO AVG-QUIZ3-OUT
              MOVE AVG-AVERAGE-GRADE TO AVG-AVERAGE-GRADE-OUT
              MOVE HIGHEST-QUIZ1 TO HIGHEST-QUIZ1-OUT
              MOVE HIGHEST-QUIZ2 TO HIGHEST-QUIZ2-OUT
              MOVE HIGHEST-QUIZ3 TO HIGHEST-QUIZ3-OUT
              MOVE LOWEST-QUIZ1 TO LOWEST-QUIZ1-OUT
              MOVE LOWEST-QUIZ2 TO LOWEST-QUIZ2-OUT
              MOVE LOWEST-QUIZ3 TO LOWEST-QUIZ3-OUT
              MOVE HIGHEST-AVERAGE TO HIGHEST-AVERAGE-OUT
              MOVE LOWEST-AVERAGE TO LOWEST-AVERAGE-OUT
              WRITE STUD-PRT-REC FROM HDG-6 AFTER 2 LINES.
              WRITE STUD-PRT-REC FROM HDG-7 AFTER 2 LINES.
              WRITE STUD-PRT-REC FROM HDG-8 AFTER 2 LINES.
              WRITE STUD-PRT-REC FROM HDG-9 AFTER 2 LINES.
              WRITE STUD-PRT-REC FROM HDG-10 AFTER 2 LINES.
              CLOSE STUD-MGR, STUD-PRT.
           STOP RUN.
       READ-RTN.
           MOVE STUD-MGR-NUMBER TO MRG-NUMBER-OUT
           MOVE STUD-MGR-NAME TO MRG-NAME-OUT
           MOVE STUD-MGR-QUIZ1 TO MRG-QUIZ1-OUT
           MOVE STUD-MGR-QUIZ2 TO MRG-QUIZ2-OUT
           MOVE STUD-MGR-QUIZ3 TO MRG-QUIZ3-OUT
           ADD 1 TO TOTAL-STUD
           COMPUTE AVG-GRADE = (STUD-MGR-QUIZ1 + STUD-MGR-QUIZ2 + 
           STUD-MGR-QUIZ3) / 3
           ADD STUD-MGR-QUIZ1 TO SUM-QUIZ1
           ADD STUD-MGR-QUIZ2 TO SUM-QUIZ2
           ADD STUD-MGR-QUIZ3 TO SUM-QUIZ3
           ADD AVG-GRADE TO SUM-AVERAGE
           MOVE AVG-GRADE TO MRG-AVERAGE-OUT
           
           IF HIGHEST-QUIZ1 = ZEROES AND HIGHEST-AVERAGE = ZEROES
               MOVE STUD-MGR-QUIZ1 TO HIGHEST-QUIZ1
               MOVE AVG-GRADE TO HIGHEST-AVERAGE
           END-IF.
           IF STUD-MGR-QUIZ1 < HIGHEST-QUIZ1 THEN
               MOVE STUD-MGR-QUIZ1 TO HIGHEST-QUIZ1
           END-IF.
           IF HIGHEST-QUIZ2 = ZEROES
               MOVE STUD-MGR-QUIZ2 TO HIGHEST-QUIZ2
           END-IF
           IF STUD-MGR-QUIZ2 < HIGHEST-QUIZ2 THEN
               MOVE STUD-MGR-QUIZ2 TO HIGHEST-QUIZ2
           END-IF.
           IF HIGHEST-QUIZ3 = ZEROES
               MOVE STUD-MGR-QUIZ3 TO HIGHEST-QUIZ3
           END-IF
           IF STUD-MGR-QUIZ3 < HIGHEST-QUIZ3 THEN
               MOVE STUD-MGR-QUIZ3 TO HIGHEST-QUIZ3
           END-IF.
           IF STUD-MGR-QUIZ1 > LOWEST-QUIZ1 THEN
               MOVE STUD-MGR-QUIZ1 TO LOWEST-QUIZ1
           END-IF.
           IF STUD-MGR-QUIZ2 > LOWEST-QUIZ2 THEN
               MOVE STUD-MGR-QUIZ2 TO LOWEST-QUIZ2
           END-IF.
           IF STUD-MGR-QUIZ3 > LOWEST-QUIZ3 THEN
               MOVE STUD-MGR-QUIZ3 TO LOWEST-QUIZ3
           END-IF.
           IF AVG-GRADE < HIGHEST-AVERAGE THEN
               MOVE AVG-GRADE TO HIGHEST-AVERAGE
           END-IF.
           IF AVG-GRADE > LOWEST-AVERAGE THEN
               MOVE AVG-GRADE TO LOWEST-AVERAGE
           END-IF.

           WRITE STUD-PRT-REC FROM PRINT-LINE.
           READ STUD-MGR AT END MOVE "YES" TO EOF.
